In [1]:
datafile = "DataFiles/Income.csv"

import pandas as pd
def readCSVfile(datafile):
    return pd.read_csv(datafile)

readCSVfile(datafile)

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [2]:
incomedf = readCSVfile(datafile)

In [3]:
incomedf.values[1:][:]

array([['04000US02', 'Alaska', 55891, 56418, 62993, 63989, 61604, 57848,
        57431, 63648, 61137],
       ['04000US04', 'Arizona', 45245, 46657, 47215, 46914, 45739, 46896,
        48621, 47044, 50602],
       ['04000US05', 'Arkansas', 36658, 37057, 40795, 39586, 36538,
        38587, 41302, 39018, 39919],
       ['04000US06', 'California', 51755, 55319, 55734, 57014, 56134,
        54283, 53367, 57020, 57528]], dtype=object)

In [4]:
incomedf.mean(axis=1)

0    41126.444444
1    60106.555556
2    47214.777778
3    38828.888889
4    55350.444444
dtype: float64

In [5]:
# Function to write DataFrame to CSV

#absincomedf.to_csv(datafile, index = False)  #update CSV file

incomedf.index = incomedf['State']
incomedf

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
State,,,,,,,,,,,
Alabama,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
Alaska,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
Arizona,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
Arkansas,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
California,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [6]:
# Mean of first row in csv data
incomedf.mean(axis=1)

State
Alabama       41126.444444
Alaska        60106.555556
Arizona       47214.777778
Arkansas      38828.888889
California    55350.444444
dtype: float64

In [7]:
incomedf.iloc[:,4:7]

             2007   2008   2009
State
Alabama     42212  44476  39980
Alaska      62993  63989  61604
Arizona     47215  46914  45739
Arkansas    40795  39586  36538
California  55734  57014  56134

In [8]:
# Combined Average income of all states from 2005 to 2013

incomedf.mean(axis=1)

State
Alabama       41126.444444
Alaska        60106.555556
Arizona       47214.777778
Arkansas      38828.888889
California    55350.444444
dtype: float64

In [9]:
# State with highest average income in last three years

incomedf.iloc[:,:3].mean(axis =1).idxmax()

'Alaska'

In [10]:
#State with lowest average income from 2007 to 2010( inclusive)

incomedf.iloc[:,4:8].mean(axis =1).idxmin()

'Arkansas'

In [11]:
# Print the list of all states in the list with averages less than california

california = incomedf.iloc[4:,:].mean(axis =1)
california = california[0]
list(incomedf[incomedf.iloc[:,2:].mean(axis =1) < california].index)

['Alabama', 'Arizona', 'Arkansas']

In [12]:
incomedf.iloc[:,2:].mean(axis=1)

State
Alabama       41126.444444
Alaska        60106.555556
Arizona       47214.777778
Arkansas      38828.888889
California    55350.444444
dtype: float64

In [13]:
incomedf

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
State,,,,,,,,,,,
Alabama,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
Alaska,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
Arizona,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
Arkansas,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
California,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [14]:
# print the names of states based on descing order of income in the year 2009

list(incomedf['2009'].sort_values(ascending = False).index)

['Alaska', 'California', 'Arizona', 'Alabama', 'Arkansas']

In [15]:
# State with the lowest recorded income from 2005 to 2013

incomedf.iloc[:,2:].idxmin()

2005    Arkansas
2006    Arkansas
2007    Arkansas
2008    Arkansas
2009    Arkansas
2010    Arkansas
2011    Arkansas
2012    Arkansas
2013    Arkansas
dtype: object